export const TERMS_TEXT = [
  "약관동의", // 0
  "전체 동의하기",
  "[필수]",
  "토크키트 이용약관",
  "개인정보 수집 및 이용",
  "[선택]", // 5
  "마케팅 수신 동의",
  "다음",
  "STEP",
];

export const EMAIL_TEXT = [
  "이메일 인증",
  "인증에 사용한 이메일은 로그인할 때 사용돼요",
  "이메일을 입력해주세요",
  "인증번호를 입력해주세요",
  "인증요청",
  "인증번호가 발송되었습니다",
  "이메일을 확인해주세요",
  "잘못된 인증번호입니다",
  "인증번호를 재요청해주세요"
];

export const DETAIL_TEXT = [
  "회원생성", // 0
  "아이디",
  "영문과 숫자를 포함하는 6자 이상의 아이디를 입력해 주세요",
  "비밀번호",
  "영문,숫자,특수기호를 포함하는 8자 이상의 비밀번호를 입력해 주세요",
  "비밀번호 확인", // 5
  "비밀번호를 다시 한 번 확인할게요",
  "닉네임",
  "영문, 한글 및 숫자로 이루어진 2글자 이상의 닉네임을 입력해주세요",
  "소속",
  "소속을 선택해 주세요", // 10
  "청소년",
  "대학생",
  "직장인",
  "기타",
  "가입완료", // 15
];

export const DETAIL_ALERT_TEXT = [
  "영문과 숫자를 포함하는 6자 이상의 아이디를 입력해 주세요",
  "사용 가능한 아이디입니다",
  "영문, 숫자, 특수기호를 포함하는 8자 이상의 비밀번호를 입력해 주세요",
  "비밀번호가 일치하지 않아요",
  "비밀번호가 일치합니다",
  "영문, 한글 및 숫자로 이루어진 2글자 이상 닉네임을 입력해 주세요",
  "사용 가능한 닉네임입니다",
  "소속을 선택해 주세요",
  "사용중인 아이디입니다",
  "사용중인 닉네임입니다",
];

export const DONE_TEXT = ["님", "회원가입을 축하드려요!", "로그인하기"];
